xhawk18/TinyThread/trunk/NANO100BSeriesBSP/Libraries/NANO1xx_Drivers/Source/nano1xx_spi.c
/******************************************************************************
 * @file     nano1xx_spi.c
 * @brief    NANO1xx SPI driver source file
 * @version  1.0.1
 * @date     04, September, 2012
 *
 * @note
 * Copyright (C) 2012-2014 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/
//* Includes ------------------------------------------------------------------*/
#include <stdio.h>
#include <string.h>
#include "nano1xx_sys.h"
#include "nano1xx_spi.h"
#include "nano1xx_assert.h"


/** @addtogroup NANO1xx_Device_Driver NANO1xx Device Driver
  @{
*/

/** @addtogroup NANO1xx_SPI_Driver SPI Driver
  @{
*/


/** @addtogroup NANO1xx_SPI_EXPORTED_FUNCTIONS SPI Exported Functions
  @{
*/

/**
  * @brief  Enable SPI engine clock.
  * @param  SpiPort: SPI port handler
  * @retval None.
  */
  
void SPI_Init(SPI_TypeDef *SpiPort)
{	
	if((uint32_t)SpiPort == SPI0_BASE)
		CLK->APBCLK |= CLK_APBCLK_SPI0_EN;		
	else if((uint32_t)SpiPort == SPI1_BASE)
		CLK->APBCLK |= CLK_APBCLK_SPI1_EN;	
	else if((uint32_t)SpiPort == SPI2_BASE)		
		CLK->APBCLK |= CLK_APBCLK_SPI2_EN;	
}

/**
  * @brief  Disable SPI engine clock.
  * @param  SpiPort: SPI port handler
  * @retval None.
  */
void SPI_DeInit(SPI_TypeDef *SpiPort)
{	
	if((uint32_t)SpiPort == SPI0_BASE)
		CLK->APBCLK &= ~CLK_APBCLK_SPI0_EN;
	else if((uint32_t)SpiPort == SPI1_BASE)
		CLK->APBCLK &= ~CLK_APBCLK_SPI1_EN;
	else if((uint32_t)SpiPort == SPI2_BASE)
		CLK->APBCLK &= ~CLK_APBCLK_SPI2_EN;	
}

/**
  * @brief  Configure the operation mode, transfer type and bit length of a 
  *         transaction of the specified SPI port.
  * @param  SpiPort: SPI port handler
  *	@param  sParam: Pointer of SPI arguments structure, including
  *    eMode: Specify the operation mode (SPI_MASTER/SPI_SLAVE).
  *	   eType: Specify the transfer type (SPI_TYPE0 ~ SPI_TYPE2).
  *	   i32BitLength: Specify the bit length in a transaction (8~32)
  * @retval SPI_ERR_BUSY: The specified SPI port is in busy status.
  *			E_SUCCESS: Success.
  */
  
/*
SPI_TYPE0:          
             _________________________________
    CS    --|          Active state           |---
               _   _   _   _   _   _   _   _  
    CLK   ____| |_| |_| |_| |_| |_| |_| |_| |_____
              
    Tx    --| 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 |-----
          
    Rx    --| 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 |-----


SPI_TYPE1:          
             _________________________________
    CS    --|          Active state           |---
               _   _   _   _   _   _   _   _  
    CLK   ____| |_| |_| |_| |_| |_| |_| |_| |_____
              
    Tx    ----| 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 |---
          
    Rx    ----| 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 |---


SPI_TYPE2:
             _________________________________
    CS    --|          Active state           |---
           ___   _   _   _   _   _   _   _   ______ 
    CLK       |_| |_| |_| |_| |_| |_| |_| |_|  
              
    Tx    ----| 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 |----
          
    Rx    ----| 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 |----


SPI_TYPE3:
             _________________________________
    CS    --|          Active state           |---
           ___   _   _   _   _   _   _   _   ______ 
    CLK       |_| |_| |_| |_| |_| |_| |_| |_|  
              
    Tx    --| 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 |------
          
    Rx    --| 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 |------
*/
int32_t SPI_Open(SPI_TypeDef *SpiPort, SPI_DATA_T *sParam)
{
	int32_t i32TimeOut;
	            
    /* Bit length 8 ~ 32 */
    assert_param(SPI_CHECK_BIT_LENGTH_0);
    	
	if((uint32_t)SpiPort == SPI0_BASE)
	{		
		GCR->IPRST_CTL2 |= GCR_IPRSTCTL2_SPI0;
		GCR->IPRST_CTL2 &= ~GCR_IPRSTCTL2_SPI0;			
	}	
	else if((uint32_t)SpiPort == SPI1_BASE)
	{	
		GCR->IPRST_CTL2 |= GCR_IPRSTCTL2_SPI1;
		GCR->IPRST_CTL2 &= ~GCR_IPRSTCTL2_SPI1;		
	}	
	else if((uint32_t)SpiPort == SPI2_BASE)
	{	
		GCR->IPRST_CTL2 |= GCR_IPRSTCTL2_SPI2;
		GCR->IPRST_CTL2 &= ~GCR_IPRSTCTL2_SPI2;		
	}
	else	
		return 0;
			
	/* Check busy*/
	i32TimeOut = 0x10000;
	while(SpiPort->CTL & SPI_CTL_GO_BUSY)
	{
		if(i32TimeOut-- <= 0)
			return SPI_ERR_BUSY;
	}
	
	/* "i32BitLength = 0" means 32 bits */
	if(sParam->i32BitLength == 32)
		sParam->i32BitLength = 0;
		
	SpiPort->CTL = (SpiPort->CTL & ~SPI_CTL_TX_BIT_LEN_MASK) | (sParam->i32BitLength << 3);
	
	SpiPort->CTL = (SpiPort->CTL & ~0x40000) | sParam->u32Mode;

	/* Default to automatic slave select and it is low active */
	SpiPort->SSR |= SPI_SSR_AUTOSS;
	
	/* Transition types */	
	SpiPort->CTL = (SpiPort->CTL & ~0x806) | sParam->u32Type;
	
    return E_SUCCESS;
}

/**
  * @brief  Close the specified SPI module and disable the SPI interrupt.
  * @param  SpiPort: SPI port handler
  * @retval None.
  */  
void SPI_Close(SPI_TypeDef *SpiPort)
{
	if((uint32_t)SpiPort == SPI0_BASE)
		NVIC_DisableIRQ(SPI0_IRQn);	
	else if((uint32_t)SpiPort == SPI1_BASE)
		NVIC_DisableIRQ(SPI1_IRQn);		
	else if((uint32_t)SpiPort == SPI2_BASE)
		NVIC_DisableIRQ(SPI2_IRQn);			
}

/**
  * @brief  Set the bit length of SPI transfer.
  * @param  SpiPort: SPI port handler
  *	@param  i32BitLength: Specify the bit length (8~32 bits).
  * @retval None.  
  */
void SPI_SetBitLength(SPI_TypeDef *SpiPort, int32_t i32BitLength)
{
	assert_param(SPI_CHECK_BIT_LENGTH_1);
   
    if(i32BitLength == 32)
        i32BitLength = 0;

	SpiPort->CTL = (SpiPort->CTL & ~SPI_CTL_TX_BIT_LEN_MASK) | (i32BitLength << 3);
}

/**
  * @brief  Set the number of clock cycle of the suspend interval.  
  * @param  SpiPort: SPI port handler
  *	@param  i32Interval: If the Byte Suspend function is enabled, it specified the delay clocks 
  *                      among each byte. It could be 2~17. 
  * @retval None.   
  */
void SPI_SetSuspendCycle(SPI_TypeDef *SpiPort, int32_t i32Interval)
{
    if(SpiPort->CTL & SPI_CTL_FIFOM) 
    	SpiPort->CTL = (SpiPort->CTL & ~SPI_CTL_SP_CYCLE) | (i32Interval << 12);
    else 
    {    
    	assert_param(SPI_CHECK_BYTE_SUS);
		SpiPort->CTL = (SpiPort->CTL & ~SPI_CTL_SP_CYCLE) | ((i32Interval-2) << 12);
	}
}

/**
  * @brief  Configure the SPI clock.
  * @param  SpiPort: SPI port handler  
  *	@param  u32Clock1: Specify the SPI clock rate in Hz. It's the clock rate of SPI base clock or variable clock 1.
  *	@param  u32Clock2: Specify the SPI clock rate in Hz. It's the clock rate of variable clock 2.
  * @retval The actual clock rate of SPI engine clock 1 is returned.
  *			The actual clock may be different to the target SPI clock due to hardware limitation.
  */
uint32_t SPI_SetClockFreq(SPI_TypeDef *SpiPort, uint32_t u32Clock1, uint32_t u32Clock2)
{
    uint32_t u32Div;
    uint32_t u32Pclk, u32CalculatedSpeed=0;
    
    u32Pclk = SPI_GetSourceClockFreq(SpiPort);
    
	if(u32Clock2!=0)
	{
		u32Div = (((u32Pclk / u32Clock2) + 1) >> 1) - 1;
		if(u32Div > 0xFF)
		    u32Div = 0xFF;
		
		u32CalculatedSpeed = u32Pclk / (2*(u32Div+1));
		if(u32CalculatedSpeed > u32Clock2)
			u32Div ++;			
		
		SpiPort->CLKDIV = (SpiPort->CLKDIV & ~SPI_CLKDIV_DIVIDER2_MASK) | (u32Div << 16);
	}
	else
		SpiPort->CLKDIV |= SPI_CLKDIV_DIVIDER2_MASK;
	
	if(u32Clock1!=0)
	{
		u32Div = ((u32Pclk / u32Clock1) >> 1);
		if(u32Div > 0x7F)
		    u32Div = 0x7F;
		
