xhawk18/TinyThread/trunk/NANO100BSeriesBSP/Libraries/NANO1xx_Drivers/Source/nano1xx_spi.c
		if(u32Div == 0)
			u32CalculatedSpeed = u32Pclk;
		else
			u32CalculatedSpeed = u32Pclk / (u32Div << 1);
		
		if(u32CalculatedSpeed > u32Clock1)
		{	
			u32Div ++;
			u32CalculatedSpeed = u32Pclk / (u32Div << 1);
		}
		
		SpiPort->CLKDIV = (SpiPort->CLKDIV & ~SPI_CLKDIV_DIVIDER1_MASK) | u32Div;
	}
	else
		SpiPort->CLKDIV |= SPI_CLKDIV_DIVIDER1_MASK;
	
	return u32CalculatedSpeed;
}

/**
  * @brief  Get the SPI engine clock rate in Hz.
  * @param  SpiPort: SPI port handler  
  * @retval The current SPI bus clock frequency in Hz.
  */
uint32_t SPI_GetClock1Freq(SPI_TypeDef *SpiPort)
{
	uint32_t u32Div;
	uint32_t u32ApbClock;

	u32ApbClock = SPI_GetSourceClockFreq(SpiPort);
	u32Div = SpiPort->CLKDIV & SPI_CLKDIV_DIVIDER1_MASK;
	
	if(u32Div == 0)	return u32ApbClock;
	else return ((u32ApbClock >> 1) / u32Div);   /* SPI_CLK = APB_CLK / (Divider * 2) */
}

/**
  * @brief  Get the clock rate of variable clock 2 in Hz.
  * @param  SpiPort: SPI port handler  
  * @retval The frequency of variable clock 2 in Hz.
  */
uint32_t SPI_GetClock2Freq(SPI_TypeDef *SpiPort)
{
	uint32_t u32Div;
	uint32_t u32ApbClock;

	u32ApbClock = SPI_GetSourceClockFreq(SpiPort);
	u32Div = (SpiPort->CLKDIV & SPI_CLKDIV_DIVIDER2_MASK) >> 16;
	return ((u32ApbClock >> 1) / (u32Div + 1));   /* SPI_CLK = APB_CLK / ((Divider + 1) * 2) */
}

/**
  * @brief  Enable the SPI interrupt of the specified SPI port and install the callback function.
  * @param  SpiPort: SPI port handler
  * @retval None.
  */
void SPI_EnableInt(SPI_TypeDef *SpiPort)
{	
	SpiPort->CTL |= SPI_CTL_INTEN;
	
	if((uint32_t)SpiPort == SPI0_BASE)	
		NVIC_EnableIRQ(SPI0_IRQn);
	else if((uint32_t)SpiPort == SPI1_BASE)	
		NVIC_EnableIRQ(SPI1_IRQn);
	else if((uint32_t)SpiPort == SPI2_BASE)		
		NVIC_EnableIRQ(SPI2_IRQn);
}	

/**
  * @brief  Disable the SPI interrupt.
  * @param  SpiPort: SPI port handler
  * @retval None.
  */
void SPI_DisableInt(SPI_TypeDef *SpiPort)
{
	SpiPort->CTL &= ~SPI_CTL_INTEN;

	if((uint32_t)SpiPort == SPI0_BASE)	
		NVIC_DisableIRQ(SPI0_IRQn);
	else if((uint32_t)SpiPort == SPI1_BASE)	
		NVIC_DisableIRQ(SPI1_IRQn);
	else if((uint32_t)SpiPort == SPI2_BASE)		
		NVIC_DisableIRQ(SPI2_IRQn);
}

/**
  * @brief  Read data from SPI Rx registers and trigger SPI for next transfer.
  * @param  SpiPort: SPI port handler
  *	@param  pu32Data:  Data got from the SPI bus.
  * @retval TRUE:  The data stored in pu32Data is valid.
  *	@retval FALSE: The data stored in pu32Data is invalid.
  */
uint8_t SPI_SingleRead(SPI_TypeDef *SpiPort, uint32_t *pu32Data)
{
	if(SpiPort->CTL & SPI_CTL_GO_BUSY)
		return FALSE;

	*pu32Data = SpiPort->RX0;
	SpiPort->CTL |= SPI_CTL_GO_BUSY;
	return TRUE;
}

/**
  * @brief  Write data to SPI bus and trigger SPI to start transfer.
  * @param  SpiPort: SPI port handler
  *	@param  pu32Data:  Data will be put to SPI bus.
  * @retval TRUE:  The data stored in pu32Data has been transferred.
  *	@retval  FALSE: The SPI is in busy. The data stored in pu32Data has not been transferred.
  */
uint8_t SPI_SingleWrite(SPI_TypeDef *SpiPort, uint32_t *pu32Data)
{
	if(SpiPort->CTL & SPI_CTL_GO_BUSY)
		return FALSE;

	SpiPort->TX0 = *pu32Data;
	SpiPort->CTL |= SPI_CTL_GO_BUSY;
	return TRUE;
}

/**
  * @brief  Read data from Rx registers. This function will not trigger another data transfer.
  * @param  SpiPort: SPI port handler
  *	@param  pu32Buf:  Store the data got from Rx registers.
  *	@param  u32DataCount: The count of data read from Rx registers.
  * @retval The count of data actually read from Rx registers.
  */
uint32_t SPI_DumpRxRegister(SPI_TypeDef *SpiPort, uint32_t *pu32Buf, uint32_t u32DataCount)
{
	assert_param(SPI_CHECK_SET_DATAREG_NUM);
	
	pu32Buf[0] = SpiPort->RX0;
	
	if(u32DataCount == 2)
		pu32Buf[1] = SpiPort->RX1;
	
    return u32DataCount;
}

/**
  * @brief  Write data to Tx registers. This function will not trigger another data transfer.
  * @param  SpiPort: SPI port handler
  *	@param  pu32Buf:  Store the data which will be written to Tx registers.
  *	@param	u32DataCount: The count of data write to Tx registers.
  * @retval The count of data actually written to Tx registers.
  */
uint32_t SPI_SetTxRegister(SPI_TypeDef *SpiPort, uint32_t *pu32Buf, uint32_t u32DataCount)
{
	assert_param(SPI_CHECK_SET_DATAREG_NUM);
	
	SpiPort->TX0 = pu32Buf[0];
	
	if(u32DataCount == 2)
		SpiPort->TX1 = pu32Buf[1];
		
    return u32DataCount;
}

/**
  * @brief  Configure the DMA Tx settings.
  * @param  SpiPort: SPI port handler
  *	@param  bEnable: TRUE/FALSE  -- Enable/Disable DMA
  * @retval None.
  */
void SPI_SetTxPDMA(SPI_TypeDef *SpiPort, uint8_t bEnable)
{
	if(bEnable)
		SpiPort->PDMA |= SPI_PDMA_TX_DMA_EN;
	else
		SpiPort->PDMA &= ~SPI_PDMA_TX_DMA_EN;
}

/**
  * @brief  Configure the DMA Rx settings.
  * @param  SpiPort: SPI port handler
  *	@param  bEnable: TRUE/FALSE  -- Enable/Disable DMA
  * @retval None.
  */
void SPI_SetRxPDMA(SPI_TypeDef *SpiPort, uint8_t bEnable)
{
	if(bEnable)
		SpiPort->PDMA |= SPI_PDMA_RX_DMA_EN;
	else
		SpiPort->PDMA &= ~SPI_PDMA_RX_DMA_EN;
}

/**
  * @brief  Enable the 3-wire SPI start interrupt of SPI and install the callback function.
  * @param  SpiPort: SPI port handler 
  * @retval None.
  */
void SPI_Enable3WireStartInt(SPI_TypeDef *SpiPort)
{ 
    SpiPort->SSR |= SPI_SSR_SSTA_INTEN;

    if((uint32_t)SpiPort == SPI0_BASE)	
	{
		NVIC_EnableIRQ(SPI0_IRQn);
		NVIC_SetPriority(SPI0_IRQn, (1<<__NVIC_PRIO_BITS) - 2);
	}
	else if((uint32_t)SpiPort == SPI1_BASE)	
	{	
		NVIC_EnableIRQ(SPI1_IRQn);
		NVIC_SetPriority(SPI1_IRQn, (1<<__NVIC_PRIO_BITS) - 2);
	}
	else if((uint32_t)SpiPort == SPI2_BASE)
	{	
		NVIC_EnableIRQ(SPI2_IRQn);
		NVIC_SetPriority(SPI2_IRQn, (1<<__NVIC_PRIO_BITS) - 2);
	}
}   

/**
  * @brief  Disable the 3-wire SPI start interrupt.
  * @param  SpiPort: SPI port handler  
  * @retval None.
  */
void SPI_Disable3WireStartInt(SPI_TypeDef *SpiPort)
{    
    SpiPort->SSR &= ~SPI_SSR_SSTA_INTEN;
    
