xhawk18/TinyThread/trunk/NANO100BSeriesBSP/Libraries/NANO1xx_Drivers/Source/nano1xx_spi.c
    if((uint32_t)SpiPort == SPI0_BASE)	
		NVIC_DisableIRQ(SPI0_IRQn);
	else if((uint32_t)SpiPort == SPI1_BASE)	
		NVIC_DisableIRQ(SPI1_IRQn);
	else if((uint32_t)SpiPort == SPI2_BASE)		
		NVIC_DisableIRQ(SPI2_IRQn);   
}

/**
  * @brief  Configure SPI wakeup function.
  * @param  SpiPort: SPI port handler
  *	@param  bEnable: TRUE/FALSE  -- Enable/Disable SPI wakeup function.
  * @retval None.
  */
void SPI_WakeupConfigure(SPI_TypeDef *SpiPort, uint8_t bEnable)
{
	if(bEnable)
		SpiPort->CTL |= SPI_CTL_WKEUP_EN;
	else
		SpiPort->CTL &= ~SPI_CTL_WKEUP_EN;
}

/**
  * @brief  Enable/disable FIFO mode. If the caller enables FIFO mode, configure the setting of suspend cycle.
  * @param  SpiPort: SPI port handler
  * @param  bEnable: Enable (TRUE) / Disable (FALSE)
  * @param  i32Interval: In FIFO mode, it could be 2~15 and 0. 0 indicates the maximum suspend interval; 2
  *                      indicates the minimum suspend interval.                                           
  * @retval None.
  */
void SPI_SetFIFOMode(SPI_TypeDef *SpiPort, uint8_t bEnable, int32_t i32Interval)
{    
    SpiPort->CTL = (SpiPort->CTL & ~SPI_CTL_SP_CYCLE) | (i32Interval << 12);
    if(bEnable)
    	SpiPort->CTL |= SPI_CTL_FIFOM;
    else
    	SpiPort->CTL &= ~SPI_CTL_FIFOM;
}

/**
  * @brief  Use FIFO mode to write 8bit data only (usually for master).
  * @param  SpiPort: SPI port handler
  * @param  pu8TxBuf: Specify the buffer to send the data using FIFO.
  *	@param  u32WriteLength: Specify the number of data.
  * @retval E_SUCCESS: Success.
  * @retval SPI_ERR_TIMEOUT: timeout.
  */
int32_t SPI_FIFOWrite8(SPI_TypeDef *SpiPort, uint8_t *pu8TxBuf, uint32_t u32WriteLength)
{
	uint32_t  u32Count, u32delayno;
	 
	for (u32Count=0; u32Count<u32WriteLength; u32Count++)
    {
    	u32delayno = 0;
	   	while (SpiPort->STATUS & SPI_STATUS_TX_FULL)  /* Wait Tx is empty and Time-out manner */
        {
       	    u32delayno++;
       	    if ( u32delayno >= 0x40000000 )     	    
       	       return SPI_ERR_TIMEOUT;   
				   
        }
        SpiPort->TX0 = pu8TxBuf[u32Count];
    }
    
    return E_SUCCESS;
}

/**
  * @brief  Use FIFO mode to write 16bit data only (usually for master).
  * @param  SpiPort: SPI port handler
  * @param  pu16TxBuf: Specify the buffer to send the data using FIFO.
  *	@param  u32WriteLength: Specify the number of data.
  * @retval E_SUCCESS: Success.
  * @retval SPI_ERR_TIMEOUT: timeout.
  */
int32_t SPI_FIFOWrite16(SPI_TypeDef *SpiPort, uint16_t *pu16TxBuf, uint32_t u32WriteLength)
{
	uint32_t  u32Count, u32delayno;
	 
	for (u32Count=0; u32Count<u32WriteLength; u32Count++)
    {
    	u32delayno = 0;
	   	while (SpiPort->STATUS & SPI_STATUS_TX_FULL)  /* Wait Tx is empty and Time-out manner */
        {
       	    u32delayno++;
       	    if ( u32delayno >= 0x40000000 )     	    
       	       return SPI_ERR_TIMEOUT;   
				   
        }
        SpiPort->TX0 = pu16TxBuf[u32Count];
    }
    
    return E_SUCCESS;
}

/**
  * @brief  Use FIFO mode to write 32bit data only (usually for master).
  * @param  SpiPort: SPI port handler
  * @param  pu32TxBuf: Specify the buffer to send the data using FIFO.
  *	@param  u32WriteLength: Specify the number of data.
  * @retval E_SUCCESS: Success.
  * @retval SPI_ERR_TIMEOUT: timeout.
  */
int32_t SPI_FIFOWrite32(SPI_TypeDef *SpiPort, uint32_t *pu32TxBuf, uint32_t u32WriteLength)
{
	uint32_t  u32Count, u32delayno;
	 
	for (u32Count=0; u32Count<u32WriteLength; u32Count++)
    {
    	u32delayno = 0;
	   	while (SpiPort->STATUS & SPI_STATUS_TX_FULL)  /* Wait Tx is empty and Time-out manner */
        {
       	    u32delayno++;
       	    if ( u32delayno >= 0x40000000 )     	    
       	       return SPI_ERR_TIMEOUT;   
				   
        }
        SpiPort->TX0 = pu32TxBuf[u32Count];
    }
    
    return E_SUCCESS;
}

/**
  * @brief  Use FIFO mode to read 8bit data only (usually for slave).
  * @param  SpiPort: SPI port handler
  * @param  pu8RxBuf: Specify the buffer to receive the data using FIFO.
  *	@param  u32ReadLength: Specify the word number of data to read.
  * @retval E_SUCCESS: Success.
  * @retval SPI_ERR_TIMEOUT: timeout.
  */
int32_t SPI_FIFORead8(SPI_TypeDef *SpiPort, uint8_t *pu8RxBuf, uint32_t u32ReadLength)
{
	uint32_t  u32Count, u32delayno;
		 	
	for (u32Count=0; u32Count<u32ReadLength; u32Count++)
    {
    	u32delayno = 0;
	   	while (SpiPort->STATUS & SPI_STATUS_RX_EMPTY)  /* Wait Rx is not empty and Time-out manner */
        {
       	    u32delayno++;
       	    if ( u32delayno >= 0x40000000 )     	    
       	       return SPI_ERR_TIMEOUT;   
				   
        }
        pu8RxBuf[u32Count] = SpiPort->RX0;
    }
    
    return E_SUCCESS;
}

/**
  * @brief  Use FIFO mode to read 16bit data only (usually for slave).
  * @param  SpiPort: SPI port handler
  * @param  pu16RxBuf: Specify the buffer to receive the data using FIFO.
  *	@param  u32ReadLength: Specify the number of data to read
  * @retval E_SUCCESS: Success.
  * @retval SPI_ERR_TIMEOUT: timeout.
  */
int32_t SPI_FIFORead16(SPI_TypeDef *SpiPort, uint16_t *pu16RxBuf, uint32_t u32ReadLength)
{
	uint32_t  u32Count, u32delayno;
		 	
	for (u32Count=0; u32Count<u32ReadLength; u32Count++)
    {
    	u32delayno = 0;
	   	while (SpiPort->STATUS & SPI_STATUS_RX_EMPTY)  /* Wait Rx is not empty and Time-out manner */
        {
       	    u32delayno++;
       	    if ( u32delayno >= 0x40000000 )     	    
       	       return SPI_ERR_TIMEOUT;   
				   
        }
        pu16RxBuf[u32Count] = SpiPort->RX0;
    }
    
    return E_SUCCESS;
}

/**
  * @brief  Use FIFO mode to read 32bit data only (usually for slave).
  * @param  SpiPort: SPI port handler
  * @param  pu32RxBuf: Specify the buffer to receive the data using FIFO.
  *	@param  u32ReadLength: Specify the number of data to read.
  * @retval E_SUCCESS: Success.
  * @retval SPI_ERR_TIMEOUT: timeout.
  */
int32_t SPI_FIFORead32(SPI_TypeDef *SpiPort, uint32_t *pu32RxBuf, uint32_t u32ReadLength)
{
	uint32_t  u32Count, u32delayno;
		 	
	for (u32Count=0; u32Count<u32ReadLength; u32Count++)
    {
    	u32delayno = 0;
	   	while (SpiPort->STATUS & SPI_STATUS_RX_EMPTY)  /* Wait Rx is not empty and Time-out manner */
        {
       	    u32delayno++;
       	    if ( u32delayno >= 0x40000000 )     	    
       	       return SPI_ERR_TIMEOUT;   
				   
