xhawk18/TinyThread/trunk/NANO100BSeriesBSP/Libraries/NANO1xx_Drivers/Source/nano1xx_spi.c
        }
        pu32RxBuf[u32Count] = SpiPort->RX0;
    }
    
    return E_SUCCESS;
}

/**
  * @brief  Use FIFO mode to read/write 8bit data at the same time  (usually for master).
  * @param  SpiPort: SPI port handler
  * @param  pu8TxBuf: Specify the buffer to transmit the data using FIFO. 
  *                   NULL: receive data only.
  *					  Otherwise: both send and receive data.
  * @param  pu8RxBuf: Specify the buffer to receive the data using FIFO.    
  *	@param  u32Length: Specify the number of data.
  * @retval None.  
  */  
void SPI_FIFOReadWrite8(SPI_TypeDef *SpiPort, uint8_t *pu8TxBuf, uint8_t *pu8RxBuf, uint32_t u32Length)
{
	uint32_t  u32Count, u32RxCount = 0;
	 
	for (u32Count=0; u32Count<u32Length; u32Count++)
    {    	
	   	while (SpiPort->STATUS & SPI_STATUS_TX_FULL)  /* if Tx is full, process Rx */
        {
       	    while(!(SpiPort->STATUS & SPI_STATUS_RX_EMPTY))
   	    		pu8RxBuf[u32RxCount++] = SpiPort->RX0;				   
        }
        
        if(pu8TxBuf == NULL)
        	SpiPort->TX0 = 0xFFFFFFFF;
        else
        	SpiPort->TX0 = pu8TxBuf[u32Count];

        if(!(SpiPort->STATUS & SPI_STATUS_RX_EMPTY))	/* check if rx has something */
    	{
    		while(!(SpiPort->STATUS & SPI_STATUS_RX_EMPTY))
    			pu8RxBuf[u32RxCount++] = SpiPort->RX0;
    	}
    }
    
    // SPI is still in progress, check Rx if something is in FIFO 
    while(SpiPort->CTL & SPI_CTL_GO_BUSY)
    {
    	while(!(SpiPort->STATUS & SPI_STATUS_RX_EMPTY))
    		pu8RxBuf[u32RxCount++] = SpiPort->RX0;
    }
    
    // SPI is finisned, but still need to check FIFO status
    while(!(SpiPort->STATUS & SPI_STATUS_RX_EMPTY))
    	pu8RxBuf[u32RxCount++] = SpiPort->RX0;
}

/**
  * @brief  Use FIFO mode to read/write 16bit data at the same time  (usually for master).
  * @param  SpiPort: SPI port handler
  * @param  pu16TxBuf: Specify the buffer to transmit the data using FIFO. 
  *                   NULL: receive data only.
  *					  Otherwise: both send and receive data.
  * @param  pu16RxBuf: Specify the buffer to receive the data using FIFO.    
  *	@param  u32Length: Specify the number of data.
  * @retval None.  
  */  
void SPI_FIFOReadWrite16(SPI_TypeDef *SpiPort, uint16_t *pu16TxBuf, uint32_t *pu16RxBuf, uint32_t u32Length)
{
	uint32_t  u32Count, u32RxCount = 0;
	 
	for (u32Count=0; u32Count<u32Length; u32Count++)
    {    	
	   	while (SpiPort->STATUS & SPI_STATUS_TX_FULL)  /* if Tx is full, process Rx */
        {
       	    while(!(SpiPort->STATUS & SPI_STATUS_RX_EMPTY))
   	    		pu16RxBuf[u32RxCount++] = SpiPort->RX0;				   
        }
        
        if(pu16TxBuf == NULL)
        	SpiPort->TX0 = 0xFFFFFFFF;
        else
        	SpiPort->TX0 = pu16TxBuf[u32Count];

        if(!(SpiPort->STATUS & SPI_STATUS_RX_EMPTY))	/* check if rx has something */
    	{
    		while(!(SpiPort->STATUS & SPI_STATUS_RX_EMPTY))
    			pu16RxBuf[u32RxCount++] = SpiPort->RX0;
    	}
    }
    
    // SPI is still in progress, check Rx if something is in FIFO 
    while(SpiPort->CTL & SPI_CTL_GO_BUSY)
    {
    	while(!(SpiPort->STATUS & SPI_STATUS_RX_EMPTY))
    		pu16RxBuf[u32RxCount++] = SpiPort->RX0;
    }
    
    // SPI is finisned, but still need to check FIFO status
    while(!(SpiPort->STATUS & SPI_STATUS_RX_EMPTY))
    	pu16RxBuf[u32RxCount++] = SpiPort->RX0;
}

/**
  * @brief  Use FIFO mode to read/write 32bit data at the same time  (usually for master).
  * @param  SpiPort: SPI port handler
  * @param  pu32TxBuf: Specify the buffer to transmit the data using FIFO. 
  *                   NULL: receive data only.
  *					  Otherwise: both send and receive data.
  * @param  pu32RxBuf: Specify the buffer to receive the data using FIFO.    
  *	@param	u32Length: Specify the number of data.
  * @retval None.  
  */  
void SPI_FIFOReadWrite32(SPI_TypeDef *SpiPort, uint32_t *pu32TxBuf, uint32_t *pu32RxBuf, uint32_t u32Length)
{
	uint32_t  u32Count, u32RxCount = 0;
	 
	for (u32Count=0; u32Count<u32Length; u32Count++)
    {    	
	   	while (SpiPort->STATUS & SPI_STATUS_TX_FULL)  /* if Tx is full, process Rx */
        {
       	    while(!(SpiPort->STATUS & SPI_STATUS_RX_EMPTY))
   	    		pu32RxBuf[u32RxCount++] = SpiPort->RX0;				   
        }
        
        if(pu32TxBuf == NULL)
        	SpiPort->TX0 = 0xFFFFFFFF;
        else
        	SpiPort->TX0 = pu32TxBuf[u32Count];

        if(!(SpiPort->STATUS & SPI_STATUS_RX_EMPTY))	/* check if rx has something */
    	{
    		while(!(SpiPort->STATUS & SPI_STATUS_RX_EMPTY))
    			pu32RxBuf[u32RxCount++] = SpiPort->RX0;
    	}
    }
    
    // SPI is still in progress, check Rx if something is in FIFO 
    while(SpiPort->CTL & SPI_CTL_GO_BUSY)
    {
    	while(!(SpiPort->STATUS & SPI_STATUS_RX_EMPTY))
    		pu32RxBuf[u32RxCount++] = SpiPort->RX0;
    }
    
    // SPI is finisned, but still need to check FIFO status
    while(!(SpiPort->STATUS & SPI_STATUS_RX_EMPTY))
    	pu32RxBuf[u32RxCount++] = SpiPort->RX0;
}

/**
  * @brief  This function is used to get SPI source clock frequency.
  * @param  SpiPort	Select the SPI port to get source clock frequency
  * @retval SPI source clock frequency (Hz).
  */
uint32_t SPI_GetSourceClockFreq(SPI_TypeDef *SpiPort)
{	
	//	Clock Source is form:
	//  (PLL, HXT, HIRC, LXT, LIRC) --> [HCLK_Div] ---> HCLK --->
	//    |                                                      [SPI_Div] ====> SPI clock
	//    +--------------------------------------------PLL------>
	//
	uint32_t u32Freq = 12000000, u32ClkSrcSel;
	
	if((uint32_t)SpiPort == SPI0_BASE)
		u32ClkSrcSel = CLK->CLKSEL2 & CLK_CLKSEL2_SPI0_MASK;
	else if((uint32_t)SpiPort == SPI1_BASE)
		u32ClkSrcSel = CLK->CLKSEL2 & CLK_CLKSEL2_SPI1_MASK;
	else 
		u32ClkSrcSel = CLK->CLKSEL2 & CLK_CLKSEL2_SPI2_MASK;
		
		
	if((u32ClkSrcSel == CLK_CLKSEL2_SPI0_PLL)  ||
		(u32ClkSrcSel == CLK_CLKSEL2_SPI1_PLL) ||
		(u32ClkSrcSel == CLK_CLKSEL2_SPI2_PLL))
	{
		return SYS_GetPLLClockFreq();
	}
	
	if((u32ClkSrcSel == CLK_CLKSEL2_SPI0_HCLK)  ||
		(u32ClkSrcSel == CLK_CLKSEL2_SPI1_HCLK) ||
		(u32ClkSrcSel == CLK_CLKSEL2_SPI2_HCLK))
	{
		return SYS_GetHCLKFreq();
	}
	
	return u32Freq;
}

/*@}*/ /* end of group NANO1xx_SPI_EXPORTED_FUNCTIONS */


/*@}*/ /* end of group NANO1xx_SPI_Driver */

/*@}*/ /* end of group NANO1xx_Device_Driver */

/*** (C) COPYRIGHT 2012 Nuvoton Technology Corp. ***/
